<template>
  <SwiperQW :items="items"/>
  <router-link to="/services">Services</router-link>
  <router-link to="/test">Test</router-link>
</template>

<script lang="ts">
import { defineComponent } from "vue";
import SwiperQW from "@/components/main-slider.vue";

export default defineComponent({
  name: "Home",
  components: {
    SwiperQW,
  },
  data(){
    return{
      items:[
        {
          titleSlide: 'Приложение VR GO',
          infoText: `VR-программа для реабилитации пациентов с последствиями травм и заболеваниями опорно-двигательного аппарата`,
          InfoTextSecond: 'Приложение предназначено для повышения эффективности и доступности реабилитации. Реабилитация становится возможной в любых условиях, когда и где угодно, главное – сохранение двигательной активности мышц шеи. В основу заложена подмена реального тела на виртуальный аватар, который показывает мозгу возможность движения парализованных частей тела. ',
          slideImage: '1.png',
        },
        {
          titleSlide: 'Приложение VR GO',
          infoText: 'VR-программа для реабилитации пациентов с последствиями травм и заболеваниями опорно-двигательного аппарата ',
          InfoTextSecond: 'Приложение предназначено для повышения эффективности и доступности реабилитации. Реабилитация становится возможной в любых условиях, когда и где угодно, главное – сохранение двигательной активности мышц шеи. В основу заложена подмена реального тела на виртуальный аватар, который показывает мозгу возможность движения парализованных частей тела. ',
          slideImage: '1.png',
        },
        {
          titleSlide: 'Приложение VR GO',
          infoText: 'VR-программа для реабилитации пациентов с последствиями травм и заболеваниями опорно-двигательного аппарата ',
          InfoTextSecond: 'Приложение предназначено для повышения эффективности и доступности реабилитации. Реабилитация становится возможной в любых условиях, когда и где угодно, главное – сохранение двигательной активности мышц шеи. В основу заложена подмена реального тела на виртуальный аватар, который показывает мозгу возможность движения парализованных частей тела. ',
          slideImage: '1.png',
        },
      ]
    }
  }
});
</script>
<style lang="scss" scoped>

</style>
